{
  "modelTopology": {
    "class_name": "Sequential",
    "config": [
      {
        "class_name": "Dense",
        "config": {
          "units": 10,
          "activation": "relu",
          "input_shape": [100]
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "units": 5,
          "activation": "softmax"
        }
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["./weights.bin"],
      "weights": [
        { "name": "dense_1/kernel", "shape": [100, 10], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [10], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [10, 5], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [5], "dtype": "float32" }
      ]
    }
  ]
    }
